РазработкаОУМобильная/src/Catalogs/УГМК_ЗначенияРазмеров/УГМК_ЗначенияРазмеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УГМК_ЗначенияРазмеров</name>
  <owners>Catalog.СК_ТипыРазмеров</owners>
  <attributes>
    <name>Размер1</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер2</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер3</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер4</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер5</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемПогонногоМетра</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Допуск1</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Допуск2</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Допуск3</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Допуск4</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Допуск5</name>
    <type>
      <types>Characteristic.СвойстваОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_Временный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДоступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_Мобильный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/УГМК_ЗначенияРазмеров/ObjectModule.bsl
//Функция Автонаименование( Объект) Экспорт
//	НаименованиеН = "";
//	Если ЗначениеЗаполнено( Объект.Размер1) тогда
//		НаименованиеН = НаименованиеН+"*"+Строка( Объект.Размер1);
//	КонецЕсли;
//	Если ЗначениеЗаполнено( Объект.Размер2) тогда
//		НаименованиеН = НаименованиеН+"*"+Строка( Объект.Размер2);
//	КонецЕсли;
//	Если ЗначениеЗаполнено( Объект.Размер3) тогда
//		НаименованиеН = НаименованиеН+"*"+Строка( Объект.Размер3);
//	КонецЕсли;
//	Если ЗначениеЗаполнено( Объект.Размер4) тогда
//		НаименованиеН = НаименованиеН+"*"+Строка( Объект.Размер4);
//	КонецЕсли;
//	Если ЗначениеЗаполнено( Объект.Размер5) тогда
//		НаименованиеН = НаименованиеН+"*"+Строка( Объект.Размер5);
//	КонецЕсли;
//	
//	Пока Лев( НаименованиеН, 1) = "*" цикл
//		НаименованиеН = Сред( НаименованиеН, 2);
//	КонецЦикла;
//	
//	Возврат( НаименованиеН);
//КонецФункции

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	//ОбщегоНазначения.ПриУстановкеНовогоКодаДляСправочникаИлиПВХ( ЭтотОбъект, СтандартнаяОбработка, Префикс);
КонецПроцедуры


Функция Автонаименование( Объект, НаборРазмеров = Неопределено) Экспорт
	НаименованиеН = "";
	Если НаборРазмеров = Неопределено тогда
		Если ЗначениеЗаполнено( Объект.Размер1) тогда
			НаименованиеН = НаименованиеН+"х"+XMLСтрока( Объект.Размер1);
		КонецЕсли;
		Если ЗначениеЗаполнено( Объект.Размер2) тогда
			НаименованиеН = НаименованиеН+"х"+XMLСтрока( Объект.Размер2);
		КонецЕсли;
		Если ЗначениеЗаполнено( Объект.Размер3) тогда
			НаименованиеН = НаименованиеН+"х"+XMLСтрока( Объект.Размер3);
		КонецЕсли;
		Если ЗначениеЗаполнено( Объект.Размер4) тогда
			НаименованиеН = НаименованиеН+"х"+XMLСтрока( Объект.Размер4);
		КонецЕсли;
		Если ЗначениеЗаполнено( Объект.Размер5) тогда
			НаименованиеН = НаименованиеН+"х"+XMLСтрока( Объект.Размер5);
		КонецЕсли;
		
		Пока Лев( НаименованиеН, 1) = "х" цикл
			НаименованиеН = Сред( НаименованиеН, 2);
		КонецЦикла;
	иначе
		ВидРазмера = Объект.Владелец;
		тз = ВидРазмера.ВидыРазмеров.Выгрузить();
		тз.Колонки.Добавить("Значение", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла( 15, 3));
		
		Для каждого Элемент из НаборРазмеров цикл
			СтрокаРазмера = тз.Найти( Элемент.Ключ, "ВидРазмера");
			Если СтрокаРазмера <> Неопределено тогда
				СтрокаРазмера.Значение = Элемент.Значение;
			КонецЕсли;
		КонецЦикла;
		
		ПересчитатьДополнительныеРазмеры( ВидРазмера, тз);
		
		Для каждого СтрокаРазмера из тз цикл
			Если не СтрокаРазмера.Дополнительный и не СтрокаРазмера.НеОсновной и ЗначениеЗаполнено( СтрокаРазмера.Значение) тогда
				НаименованиеН = НаименованиеН+СтрокаРазмера.Соединитель+XMLСтрока( СтрокаРазмера.Значение);
			ИначеЕсли СтрокаРазмера.НеОсновной Тогда
				НаименованиеН = НаименованиеН+СтрокаРазмера.Соединитель+"("+XMLСтрока( СтрокаРазмера.Значение)+")";
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат( НаименованиеН);
КонецФункции

Процедура ПересчитатьДополнительныеРазмеры( ВидРазмера, тз)
КонецПроцедуры
